BellerageHackathon/src/Documents/РезультатПопытки/РезультатПопытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезультатПопытки</name>
  <posting>Deny</posting>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПопытки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>РевизияРезультата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНазначения</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.КандидатыВнешние</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКандидатаСнимок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияТеста</name>
    <type>
      <types>CatalogRef.ВерсииТестов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХэшВерсииТеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗавершения</name>
    <type>
      <types>EnumRef.СпособыЗавершенияПопытки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроверки</name>
    <type>
      <types>EnumRef.СтатусыПроверкиПопытки</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатПрохождения</name>
    <type>
      <types>EnumRef.РезультатыПрохождения</types>
    </type>
  </attributes>
  <attributes>
    <name>НабраноБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимумБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПравильныхОтветов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнойБаллСнимок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьСекунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХэшИсходногоСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходноеСообщение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ответы</name>
    <attributes>
      <name>ИдентификаторОтвета</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВПопытке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВопросВерсии</name>
      <type>
        <types>CatalogRef.ВопросыВерсийТестов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВопросаСнимок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОтветаСнимок</name>
      <type>
        <types>EnumRef.ТипыОтветов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстовыйОтвет</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветДан</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПроверки</name>
      <type>
        <types>EnumRef.СтатусыПроверкиОтвета</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветПравильный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НабраноБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйБалл</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийПроверки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВариантыОтветов</name>
    <attributes>
      <name>ИдентификаторОтвета</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОтветаВерсии</name>
      <type>
        <types>CatalogRef.ВариантыОтветовВерсий</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторВерсииВарианта</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядокВПопытке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстВариантаСнимок</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выбран</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BellerageHackathon/src/Enums/СтатусыПроверкиПопытки/СтатусыПроверкиПопытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроверкиПопытки</name>
  <enumValues>
    <name>НеПроверена</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаАвтоматически</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетРучнойПроверки</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаВручную</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/РезультатыПрохождения/РезультатыПрохождения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыПрохождения</name>
  <enumValues>
    <name>НеОпределен</name>
  </enumValues>
  <enumValues>
    <name>Пройден</name>
  </enumValues>
  <enumValues>
    <name>НеПройден</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Documents/РезультатПопытки/ObjectModule.bsl
Процедура ОбработкаЗаполнения(
	ДанныеЗаполнения,
	ТекстЗаполнения,
	СтандартнаяОбработка)

	Если Дата = Дата(1, 1, 1) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;

	Если ДатаПолучения = Дата(1, 1, 1) Тогда
		ДатаПолучения = ТекущаяДатаСеанса();
	КонецЕсли;

	Если РевизияРезультата = 0 Тогда
		РевизияРезультата = 1;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СтатусПроверки) Тогда
		СтатусПроверки = Перечисления.СтатусыПроверкиПопытки.НеПроверена;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(РезультатПрохождения) Тогда
		РезультатПрохождения = Перечисления.РезультатыПрохождения.НеОпределен;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроверитьШапку();
	ПроверитьОтветыИВарианты();

	ПроверкаВручную =
		СтатусПроверки = Перечисления.СтатусыПроверкиПопытки.ПроверенаВручную;

#Если Сервер Тогда
	РасчетРезультатовТестовСервер.ЗаполнитьИтогиПопытки(
		ЭтотОбъект,
		ПроверкаВручную);
#КонецЕсли

	ДлительностьСекунд = Цел(ДатаЗавершения - ДатаНачала);
	ПроверитьУникальность();

КонецПроцедуры

Процедура ПроверитьШапку()

	Если Не ЗначениеЗаполнено(ИдентификаторСообщения) Тогда
		ВызватьИсключение "Не указан идентификатор входящего сообщения.";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторПопытки) Тогда
		ВызватьИсключение "Не указан идентификатор попытки.";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторНазначения) Тогда
		ВызватьИсключение "Не указан идентификатор назначения.";
	КонецЕсли;

	Если РевизияРезультата < 1 Тогда
		ВызватьИсключение "Ревизия результата должна быть положительной.";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Кандидат)
		Или Не ЗначениеЗаполнено(Тест)
		Или Не ЗначениеЗаполнено(ВерсияТеста) Тогда
		ВызватьИсключение "Не заполнены кандидат, тест или версия теста.";
	КонецЕсли;

	Если ВерсияТеста.Владелец <> Тест Тогда
		ВызватьИсключение "Версия результата принадлежит другому тесту.";
	КонецЕсли;

	Если ПустаяСтрока(ХэшВерсииТеста)
		Или ПустаяСтрока(ХэшИсходногоСообщения) Тогда
		ВызватьИсключение "Не заполнены хэши версии теста или сообщения.";
	КонецЕсли;

	Если ДатаНачала = Дата(1, 1, 1)
		Или ДатаЗавершения = Дата(1, 1, 1)
		Или ДатаЗавершения < ДатаНачала Тогда
		ВызватьИсключение "Некорректный интервал выполнения теста.";
	КонецЕсли;

	Если ПроходнойБаллСнимок < 0
		Или ПроходнойБаллСнимок > 100 Тогда
		ВызватьИсключение "Проходной балл должен быть от 0 до 100.";
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьОтветыИВарианты()

	Если Ответы.Количество() = 0 Тогда
		ВызватьИсключение "В результате попытки отсутствуют ответы.";
	КонецЕсли;

	ВопросыПоОтветам = Новый Соответствие;
	ПорядкиОтветов = Новый Соответствие;

	Для Каждого Ответ Из Ответы Цикл
		Если Не ЗначениеЗаполнено(Ответ.ИдентификаторОтвета) Тогда
			ВызватьИсключение "У ответа отсутствует идентификатор.";
		КонецЕсли;

		КлючОтвета = Строка(Ответ.ИдентификаторОтвета);
		Если ВопросыПоОтветам.Получить(КлючОтвета) <> Неопределено Тогда
			ВызватьИсключение "Идентификатор ответа повторяется.";
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Ответ.ВопросВерсии)
			Или Ответ.ВопросВерсии.Владелец <> ВерсияТеста Тогда
			ВызватьИсключение "Ответ ссылается на вопрос другой версии теста.";
		КонецЕсли;

		Если Ответ.ПорядокВПопытке < 1 Тогда
			ВызватьИсключение "Порядок ответа должен быть положительным.";
		КонецЕсли;

		КлючПорядка = Строка(Ответ.ПорядокВПопытке);
		Если ПорядкиОтветов.Получить(КлючПорядка) <> Неопределено Тогда
			ВызватьИсключение "Порядок вопроса в попытке повторяется.";
		КонецЕсли;

		ВопросыПоОтветам.Вставить(КлючОтвета, Ответ.ВопросВерсии);
		ПорядкиОтветов.Вставить(КлючПорядка, Истина);
	КонецЦикла;

	ПорядкиВариантов = Новый Соответствие;
	Для Каждого Вариант Из ВариантыОтветов Цикл
		КлючОтвета = Строка(Вариант.ИдентификаторОтвета);
		ВопросВерсии = ВопросыПоОтветам.Получить(КлючОтвета);

		Если ВопросВерсии = Неопределено Тогда
			ВызватьИсключение "Показанный вариант не связан со строкой ответа.";
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Вариант.ВариантОтветаВерсии)
			Или Вариант.ВариантОтветаВерсии.Владелец <> ВопросВерсии Тогда
			ВызватьИсключение "Показанный вариант принадлежит другому вопросу.";
		КонецЕсли;

		КлючПорядка = КлючОтвета + ":" + Строка(Вариант.ПорядокВПопытке);
		Если Вариант.ПорядокВПопытке < 1
			Или ПорядкиВариантов.Получить(КлючПорядка) <> Неопределено Тогда
			ВызватьИсключение "Некорректный или повторяющийся порядок варианта.";
		КонецЕсли;

		ПорядкиВариантов.Вставить(КлючПорядка, Истина);
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьУникальность()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Результаты.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РезультатПопытки КАК Результаты
	|ГДЕ
	|	Результаты.Ссылка <> &Ссылка
	|	И (Результаты.ИдентификаторСообщения = &ИдентификаторСообщения
	|		ИЛИ (Результаты.ИдентификаторПопытки = &ИдентификаторПопытки
	|			И Результаты.РевизияРезультата = &РевизияРезультата))";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторСообщения", ИдентификаторСообщения);
	Запрос.УстановитьПараметр("ИдентификаторПопытки", ИдентификаторПопытки);
	Запрос.УстановитьПараметр("РевизияРезультата", РевизияРезультата);

	Если Не Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение "Сообщение или ревизия результата уже зарегистрированы.";
	КонецЕсли;

КонецПроцедуры
